#### 🏗️ Terraform Plan Results

**Status**: success
**Triggered by**: @ALIBCJH

<details><summary>View Full Terraform Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main_key: Refreshing state... [id=20d280c9ea5c935dd9b9db39e480c24d0b477674]
data.http.my_ip: Reading...
local_file.ssh_key_file: Refreshing state... [id=aba15c4d93e252e915aaaa24af5bdefb521d0c44]
data.http.my_ip: Read complete after 0s [id=http://ipv4.icanhazip.com]
aws_iam_role.ec2_ssm_role: Refreshing state... [id=juma-ec2-ssm-role-v3]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking]
aws_vpc.main: Refreshing state... [id=vpc-0bdf5771cf0d41a9e]
aws_key_pair.generated_key: Refreshing state... [id=juma-stockholm-key-v3]
aws_s3_bucket.terraform_state: Refreshing state... [id=juma-terraform-state-storage-2026]
aws_iam_role_policy_attachment.ssm_policy: Refreshing state... [id=juma-ec2-ssm-role-v3/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_iam_instance_profile.ssm_profile: Refreshing state... [id=juma-ssm-instance-profile-v3]
aws_internet_gateway.gw: Refreshing state... [id=igw-017e9a2a32b79ffb8]
aws_subnet.public: Refreshing state... [id=subnet-0d95a71c167d0a5c3]
aws_subnet.public_b: Refreshing state... [id=subnet-0280382f1a7b3fa34]
aws_security_group.allow_ssh_pg: Refreshing state... [id=sg-0ce277fd535ad30a0]
aws_route_table.public_rt: Refreshing state... [id=rtb-061884564804a52ec]
aws_security_group.rds_sg: Refreshing state... [id=sg-037f1bf105b40dd32]
aws_db_subnet_group.db_subnets: Refreshing state... [id=juma-db-subnet-group-v4]
aws_instance.web: Refreshing state... [id=i-0412e3966d38f3681]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-02eaf2031cb68086c]
aws_route_table_association.b: Refreshing state... [id=rtbassoc-0f3a9bb20ef5a78f0]
aws_s3_bucket_versioning.enabled: Refreshing state... [id=juma-terraform-state-storage-2026]
aws_db_instance.postgres: Refreshing state... [id=db-AKACO5E3BJ5ACE6R4CRBGCXN5U]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ssh_key_file will be created
  + resource "local_file" "ssh_key_file" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "juma-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

---
**Next Steps**: 
- Review the plan above
- If changes look good, approve and merge this PR
- Merging to `main` will automatically apply these changes

*Workflow run: [1](https://github.com/ALIBCJH/Digital-Transformation/actions/runs/22834731694)*